import React, { Component } from "react";
import User from "./componet/54.state/users_film54";
import "./App.css";
export default class App_film54 extends Component {
  constructor(props) {
    super(props);

    this.state = {
      users: [
        { id: 1, name: "mohammad" },
        { id: 2, name: "reza" },
        { id: 3, name: "amir" },
        { id: 4, name: "ali" },
      ],
    };

    this.clickHandler = this.clickHandler.bind(this);
    this.code = 25;
  }

  clickHandler() {
    this.code = 100;
    console.log(this);
  }

  render() {
    return (
      <ul>
        {/* <h1 onClick={this.clickHandler.bind(this)}>{this.code}</h1>  */}
        {/* <h1 onClick={() => this.clickHandler()}>{this.code}</h1> */}
        <h1 onClick={this.clickHandler}>{this.code}</h1>
        <User {...this.state.users[0]} />
        <User {...this.state.users[1]} />
        <User {...this.state.users[2]} />
        <User {...this.state.users[3]} />
      </ul>
    );
  }
}

// توضیحات
// همونطور که در خروحی جلسه قبل مشخصه وقتی روی اچ وان کلیک میکردیم ارور میداد و مقدارش از 25 به 100 تغییر پیدا نمیکرد و برای رفع این مشکل میتونیم از سه تا روش استفاده بکنیم
// 1. بگریم دیس دیگه العان به اندیفایند اشاره نخواهد کرد و به خود کلاس اپپ ما اشاره خواهد کرد  اول اینحوری که من داخل اچ وان میگم که اگر انکلیکی روی اچ وانم اتفاق افتاد برای من از همین کلاسم متدد کلیکهندلر رو فراخوانی بکن و توش بایند بکن و داخل بایند میگم دیس رو براش بایند بکن یعنی داخل این کلاس من این متدد کلیک هندلر کلیمه کلیدی دیس به همین کلاس اشاره بکنه  ن اندیفایند پس من العان اگر توی این قسمت بگم کلیک هندلر مقدار پروپرتی کدم 35باشه و سپس دیس رو لاگ کی
// 2. روش بعدی استفاده از ارو فانکشن هست من توی قسمتی که اچ وان انکلیک ارو فانکشن میخام فراخانی بشه که داخل ارو فانکشن میگم دیس دات کلیک هلندلر به همین راحتی الان توی این خط ارو فانشکن میاد خود به خود بدون دخالت من میاد همون بایند دیس رو انجام میده واسم و دیگه نیازی به بایند هم نیس
// توی ارو فانکشن ما العان بهش گفتیم که برام یک ارو فانکشن احرا بکن که داخل ارو فانشکن واسه من من دیس دات کلیک هندلر رو فراخانی بکن چونکه من توی این قسمت فراخانی نکرده بودم برای من اینحا اجرا نمیشد وقتی که توی خط 46 به همین روش بهش میگیم نیازی به پرانتز باز و بسته نیست اما من براش یک فانکشن دادم و این کلیک هندلر من داخل این فانکشن ارو داره انجام میشه پس فراخانی اینجا نیاز هست و العان اگر 25 عمل کیلیک انججام بدم برای من اپ رو لاگ میگیره  که خروجی اپ 45 شده
// 3. روش اخر کلیک هندلر رو فراخانی میکنم اما بایند رو کانسراکتور انجام میدم و اینجا براش مینویسم که باری من مقدار دیس دات کلیک هندلر برابر باشه با دیس دات کلیک هندلر دات بایند دیس
