import React, { Component } from 'react'
import './App.css'
import Users from './componet/64.User/user'

export default class Film63 extends Component {

 

   state = {
    users: [
      {id: 1, name: "mohammad" , age: 18},
      {id: 2, name: "reza" , age: 16},
      {id: 3, name: "amir" , age: 19},
      {id: 4, name: "ali" , age: 22},

    ]
   }
 

  render() {
return (
     <div>
       {this.state.users.map((user , index) => (
         <div key={index}>
         {/* <div key={user.id}> */}
         <Users {...user}/>
        </div>
       ))}
     </div>
    )
  }
}
// توضیحات
// پراپ کی که همیشه همیشه توی استفاده از برای والد پرنت المنتتون حتما حتما ارسال کنید و توی قسمت پرنت یوزر  به مقدار کی دسترسی نداریم و اصلا برای ما نیست و پراپی نیست که ما بخایم به دلخواه خودمون تعریفش کرده باشم  یک پراپی هست که ریاکت ازمون میخاد تا احیانا توی اجرا و رفتار و عملکرد پروژمون یکی از دیو ها بخان حذف بشه یکی اضافه بشه ریاکت بتونه این هندل کردن و اضافه کردن رو حساب کتاب بکنه و با خودش یجورایی اون هندل پروژه براشون راحت تر باشه  
// برای اینکه ریاکت بفهمه و اون حساب کتاب های لازم رو و پشت پرده رو انجام بده برای اون تودو ما ما براش یک پراپی رو ارسال میکنیم که باید یونیک و منحصور باشه
// یعنی مثل همون ایدی اچ تی ام ال که میگفتیم منحصر به فرد باشه توی این قسمت برای هر تودوی که به اضاش یک ال ای رندر میشه من به عنوان برنامه نویس ریاکت موضفم و مجبورم یک دونه مقدار به عنوان پراپی به عنوان کی در نظر بگیرم و براش ارسال بکنم اما من فقط اراسل میکنم و هیچجا هیچ کاری براش انجام نمیدم و گفتم این مخصوص ریاکت هست  
// یعنی فقط ریاکت پشت پرده و بک گراند خودش با این پراپ کار داره و همیشه همیشه به اعضای هر تودویی که براش یک ال ای رندر میشه و اجرا میشه براش موضفیم که پراپ به اسم کی ب ه طور منهرصر به فرد ارسال بکنیم همونطور که اینجا متوجه شدیم برای قسمتی که ارایه یوزمون توی این قسمت گفتیم از هر کدوم از این یوزر ها یی که با عنوان ابجکتن اینجا هستن گفتیم  به اعضای هر یوزر یک همچین دیوی که اجرا بشه رندر بشه که داخلش همچین کامپونتی به اسم یوزر فراخانی کردیم اجرا کردیم و داخلش براش مقادیر و پراپرتی های  هر کدوم از این یوزر های ابجکت رو براش به شکل اسپرد سینتکس ارسال کردیم اما چونکه اینجا این برای ما والد به حساب میاد ما اینجا موضفیم که براش پراپی به اسم کی ارسال کنیم 