import React, { Component } from "react";
import User from "./componet/54.state/users_film54";
export default class App_film54 extends Component {
  constructor(props) {
    super(props);

    this.state = {
      users: [
        { id: 1, name: "mohammad" },
        { id: 2, name: "reza" },
        { id: 3, name: "amir" },
        { id: 4, name: "ali" },
      ],
    };
  }

  render() {
    return (
      <div>
        <User {...this.state.users[0]} />
        <User {...this.state.users[1]} />
        <User {...this.state.users[2]} />
        <User {...this.state.users[3]} />
      </div>
    );
  }
}

// توضیحات
// استیت توی لغت به معنای حالت
// که میتونیم به طور کلی تمامی دیتا هاس هر کدوم از کامپونت هامون رو داخل استیت همان کامپونت ذخیره بکنیم و هر کجا که نیاز داشتیم از همان استیت استفاده بکنیم و از اطلاعاتش بیام و داخل جی اس سیکس نمایششون بدیم و استفاده لازم رو ببریم
// و تفاوت بین استیت و پراپت اینجاست پراپت ها مقادیر رید انلی هستن و به هیچ عنوان نمیشه که دستکاریشون کرد اما استیت رید انلی نیستن و ما هر موقع که بخایم یکی از یوزر هامو. از این قسمت پاک بکنم میتونم از داخل استیتم پاکش بکنم
// و میتونم طی اجرا و عملکرد پروژه و برنامه خدم بیام دیتایی رو از استیت پاک بکنم چیزی رو به استیت اضافه بکنم یا چیزی رو اپدیت بکنم پس استیت یک حالت هست که یک قابلیتی هستش که بهمون این اجازه رو میده که بتونیم دیتا هایی  هر کامپونت رو داخل خود همان کامپونت ذخیره بکنیم و طی اجرا و عملکرد پروژه از اون اطلاعات استیت استفاده بکنیم و هر کجا که از بود هر کدوم از استیت هامون هر کدوم از دیتا هایی که توی استیتمون هستش رو تغییرشون بدیم
// وقتی میگیم دیس دات استیت کل این ابجکت به طور مثال خط 9 رو شامل میشه
// همیشه باید استیت هامون رو داخل کانسراکتور ست و تعریف بکنید که به محض استفاده از این کامپونت این کلاس بیاد و کانسراکتور شورو فراخانی بشه و اجرا بشه
// نکته اگر پراپ داشتیم و یا اگر نداشتیم این دو خط رو بنویسید و براش پراپ رو دریافت بکنید و از این قسمت ارسال بکنید داخل کامپونت والد و یا کلس والد که از اونجا ارس بری انجام بشه
// خلاصه استیت ها زمانی استفاده میشن که ما بخایم اطلاعات و جزعیات یک کلاس کاپونت رو داخل خود همون کامپونت ذخیره بکنیم
