import React, { Component } from 'react'
import './App.css'
import Users from './componet/64.User/user'

export default class Film63 extends Component {

 

   state = {
    users: [
      {id: 1, name: "mohammad" , age: 18},
      {id: 2, name: "reza" , age: 16},
      {id: 3, name: "amir" , age: 19},
      {id: 4, name: "ali" , age: 22},

    ]
   }
 

  render() {
return (
     <div>
       {this.state.users.map((user , index) => (
         <div key={index}>
         {/* <div key={user.id}> */}
         <Users {...user}/>
        </div>
       ))}
     </div>
    )
  }
}
// توضیحات
// ما جلسه قبل گفتیم از ایندکس ایتم ها برای کیز به هیچ عنوان استفاده نکنیم اما چر ا . ما گفتیم که ریاکت ازمون این پراپ کی رو میخاد برای راحتی  رندز کردن کل پروژه 
// پس العان توی این قسمت ایندکس اقای محمد چنده صفره ایندکس اقای رضا یک هست ایندکس امیر دو و ایندکس علی سه هستش 
// و این پراپ هاشونم طبق این صفر الی سه میره اما شما العان فرض کنید که توی اجرا پروژه هستیم و اقای علی و اقای امیر 
// ریاک بهمون گفته پراپ کی فقط و فقط باری مپ هستش یعنی فقط زمانی استفاده میشه که بخایم مپی انجام بدیم 
// اگه در ارایه یوزر مقدار امیر اگه بخواد حذف بشه بازم ایدی ها و بقیه ایتم ها بهم نمیخوره و سرجاشون ثابت هسته 