import React, { Component } from "react";
import User from "./componet/54.state/users_film54";
export default class App_film54 extends Component {
  constructor(props) {
    super(props);

    this.state = {
      users: [
        { id: 1, name: "mohammad" },
        { id: 2, name: "reza" },
        { id: 3, name: "amir" },
        { id: 4, name: "ali" },
      ],
    };

    this.code = 25;
  }

  clickHandler() {
    this.code = 100;
    console.log("clicked");
  }

  render() {
    return (
      <ul>
        <h1 onClick={this.clickHandler}>{this.code}</h1>
        <User {...this.state.users[0]} />
        <User {...this.state.users[1]} />
        <User {...this.state.users[2]} />
        <User {...this.state.users[3]} />
      </ul>
    );
  }
}

// توضیحات
// اسم وریبل ما اسم ایونت ما اسم فانکشن ما اسم پروپرتی ما هر چند تا کلمه که باشه کلمه اول کلا کوچیک نوشته میشه و فقط فقط حرف اول کلمات بعدی بزرگ نوشته میشه مثال onClick ~ onKeyDown
// توی ریاکت همه ی ایونت هامون بدون اسنثنا با سینتکس کمل کیس نوشته میشه و سپس مثل همون دیفالت اچ تی ام ال براش یک مساوی قرار میدیم و اینجا چون میخایم از یک کد اکس پرژن جی اسی استفاده کنیم میخایم یک متددی رو فراخانی و اجرا بکنیم داخل داخل اکولاد قرارش میدیم و سپس اسم اون فانکشن اون متدد رو اینجا قرار میدیهم اما جلوش پرانتز باز و بسته قرار نمیدهیم
// چون اگر توی ریاکت روی فانکشن یک پرانتز باز و بسته قرار بگیره اون همون لحظه فراخانی میشه یعنی به محض اینکه صحفه ما لود میشه و مرورگر به این خط ما میرسه میاد همان متدد رو برای ما اجرا میکنه و فراخانی میکنه بدون اینکه ایونتی اصلا اجرا شده باشه
// پس در قسمت پایین فانکشن یا همون متدد رو اجرا نمیکنیم بلکه رفرنس میدهیم بهش ارجا میدیهم و هر موقع که انکلیک اتفاق بیوفته اون موقههمچین متددی برای ما اجرا میشه و فراخانی میشه
// In React{/* <button onClick={clickHandler}></button> */} //
// In HTML{/* <button onclick="clickHandler()"></button> */} //
// برای دسترسی به مقدار پروپرتی های هرکلاس و به متدد های هر کلاس نیاز به کلمه کلیدی دیس داریم به عنوان مثال جایی که اچ وان رو ریترن کردم گفتم دیس دات کد پایینش گفتم دیس دات استیت اما با اینکه کلیک هندلر یکی از متدد های همین کلاس هستش من توی ان کلیک اچ وان قسمت دیس رو براش ننوشتم
